BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>MSu1G5Yh3OmkiczIGFeemyPqxnoRqQUwfqen1m0EQkvE58brtB2b1vdMnJRzfgFcPqTXrfO1r7Ed&#13;
AzLGPfw7ThhxqWLbumRPuVfksRtOHXKAXwEbnccUseyOl+5h+Fc0R7qQXcDYmMlXfeJa9zW7KMte&#13;
XJAfkiwi6O/g6vmVheZjYL67fXphUqnOgvgKUelOiYauE1jmTXZn/BKvAwuB2VtkzYoRu7iC2nJY&#13;
cNHqxmYH6wrYSmibcLHJxg2yoy00PW+b0U7ut7NloGR0JO91r2edEgZoe3OHUDlLZ3xmSHiRSsq9&#13;
2UBVoXau10dJdDpRnKYAdcGYQi5tK/ix9t7Sog==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>BhbUxcHGO767Ucr6nlIXjELiDA6k/ldAaU5Gvbr+B33uXLuqMrM84c9gm17Nj77F2CQh3del7Tu4&#13;
A8rvrilr2zzbRt92Dca1qHdg8aQ2XltCbAj+2Eqc60g9UjkpDmjDlFhXjoDoMizEVisUKr13NEDg&#13;
aBDlKHQrerctd79WTsN2aoCndyPua8INuGbKa5uM6yBLxRSkBXM3TtzHIJryb3g0+fSMz9N9Z9AM&#13;
A3Jtk3neg/tD99NM2s7zJzGsvS4qu9d0W43Nhbh3ZARR+puS4F6sHEm8/Kdp4SSMhOzcBrHbYRTv&#13;
6jdwIlJmgWGgNhpuw8CDfv65Rhgc8kswBCjQenpWazA6yWxbUGqF/P4y1fSgwK6Pf7aNBiTGf2kR&#13;
57ha+70Oa0a1dg+d2GSeQgFkcDcH4pqLYH0KXaTBNhBaBMHmWIvRH5xZkur/bBEJOmCvpaa5h19O&#13;
RG4kw+ppWcNme9mS8ZjXOYUs1gYfS9JsgGt5dws/N2BKVZWI1lCsbYwZ8bSADEOuwAEoVF96Ny9W&#13;
YCBG7vVRDUe0hhF4cK3ME6Mrn9kEKEdpkTSqz6Ga9gQ9wP2lbsc0LEdAOHkijteFXasezG1c03je&#13;
OZtY3aZvhI8Ko3nrsaM2VOEQHVxzf6Q+1Baj7M4Ke2jqUMjnDj6P6g15/nxP7CufKO8/Wl5M5AfF&#13;
kvy1yQzKwjx3Wfcrd9GBKNgNpSwkwcAmINluiTCqOVpBRpe3u65UITA4w5pYbzTCjHbWPcRR2VHf&#13;
4g3nkFDoP1W+1jJABdYQPp+K8t+As6TfmVkYwheP4TpajSOv7lDbzEW/IeC9m8V5zqKBTf9q6ZW2&#13;
0m8WEEDh4lGzf8SjTpvTQ6+49DFk3zfFxOwJQOOkva+Bx1fCywVcy1jn7S7yOttGE2ZSdcBTTWv3&#13;
PtzQTJWkMLVP8WKuhRNEveDcZb2bnXn6WoMXBfEsmpLD1ASDdwmT1KtRciuFTe37N9A4r+zpiy3G&#13;
X8TTi9rZWICtZCxSBSerNCkUIIFXSQCQUDkZWvUNW2ANKbObxARzQtp9LknCZJfqS6h53YyaAav1&#13;
sleYLeVXBKDdN7M76WNalQq8opNtmXf1re+AUIte9fEXg5dWa0IJK4WNNaTi1pt9Vnd5SJTCyoW+&#13;
P2xMeErvGpMjBtACl5gnL9wYgsPoWsmPz81Ao/2YhF7IRHIhnwRqv7uaVUwlWqT3SOQDBLPxHji6&#13;
v845OqE1oG3WN2oRcqVerh1rFP1qrX85B3Wpe+sIPz6BiD5nIZFTzevznHL8jcqgSPJMLl08U84Q&#13;
OY9FhXyRveKRz+lmgRRCyDeqem8Z8YVzVLJNqN0x9yXENhksgBb5R2joAwa4Mc40bLsik6GoF4e6&#13;
5MvVhKfUJsYnNOzMHUyMT4Mu4SOReWEUj0bvtwO+</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>F900UoqW/LIim8TuaJoVHCoPOKQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
I+Eit+WaYumxsUfYPXeZEuFWqJOotJU+jSJwIoCDh4ckRxTYFmwF+cI30dhVO66jgEaKpYOTGQv2&#13;
z//n6lkpW/Lx2DLaVbH932SOK+Su4hUzjnT0711W15eCIojNplyHFB608AWqTB0kFxlmRLN9l3qk&#13;
12+hqOL+lWVLg78bEOgVLncg2d0NekBwldv3XLcmat3DIdgJ4NG232i2HR038SMh+fPXjmpAQ3+W&#13;
spN0CvAgQYsm/FFVwYRqiIAIoPkRjbSljqVIGPw1CIugR7kBigeebo7ugMA7nyHYY7dghiwyGHcY&#13;
ciq8x5JAkldfJrmWG03hWQsINUX3pJ8H02WkWw==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>